BOT_TOKEN = "YOUR_BOT_TOKEN"
detailed_data_about_rooms = {
    1101: {
        "do_use": ["Балтабай"],
        "do_not_use": ["Алишер", "Айдар"]
    },
    1102: {
        "do_use": ["Сулейман"],
        "do_not_use": ["Санжар", "Нурбек"]
    },
    1103: {
        "do_use": ["Ернар", "Нурсат"],
        "do_not_use": []
    },
    1104: {
        "do_use": ["Нарбота", "Султан", "Елнур"],
        "do_not_use": []
    },
    1105: {
        "do_use": ["Даурен", "Санжар", "Арслан"],
        "do_not_use": []
    },
    1106: {
        "do_use": ["Маржан", "Айболат"],
        "do_not_use": ["Нуртай"]
    },
    1107: {
        "do_use": ["Даулет", "Асланбек", "Темирлан"],
        "do_not_use": []
    },
    1108: {
        "do_use": ["Мурат", "Елмурат", "Диас"],
        "do_not_use": []
    },
    1109: {
        "do_use": ["Жасултан", "Нурсултан", "Амир"],
        "do_not_use": []
    },
    1110: {
        "do_use": ["Никита", "Аспандияр", "Амир"],
        "do_not_use": []
    },
    1111: {
        "do_use": ["Имран", "Ганибек", "Арман"],
        "do_not_use": []
    },
    1112: {
        "do_use": [],
        "do_not_use": ["Алихан", "Хакназар", "Байдос"]
    },
    1113: {
        "do_use": ["Нурмухамед"],
        "do_not_use": ["Абылай", "Темирлан"]
    },
    1114: {
        "do_use": ["Али", "Ержан", "Алишер"],
        "do_not_use": [ ]
    },
    1115: {
        "do_use": ["Максат", "Айбол"],
        "do_not_use": ["Даурен"]
    },
    1116: {
        "do_use": ["Даулет"],
        "do_not_use": ["Нурсултан", "Нурсултан"]
    },
    1117: {
        "do_use": ["Тамерлан", "Ансар", "Досбол"],
        "do_not_use": []
    },
    1118: {
        "do_use": ["Жанадил"],
        "do_not_use": ["Арлан", "Абылайхан"]
    },
    1119: {
        "do_use": ["Султан", "Алихан", "Рахат"],
        "do_not_use": []
    },
    1120: {
        "do_use": ["Алан", "Тимур"],
        "do_not_use": ["Димаш"]
    },
    1121: {
        "do_use": ["Алишер", "Данияр", "Айсултан"],
        "do_not_use": []
    },
    1122: {
        "do_use": ["Бакдаулет", "Бакытжан", "Ансар"],
        "do_not_use": []
    },
    1123: {
        "do_use": ["Дияр", "Ерасыл", "Файзулла"],
        "do_not_use": []
    },
    1124: {
        "do_use": ["Танат", "Ескендир"],
        "do_not_use": ["Жангир"]
    },
    1125: {
        "do_use": ["Дарын", "Ренат", "Еркебулан"],
        "do_not_use": []
    },
    1126: {
        "do_use": ["Маргулан"],
        "do_not_use": ["Алпамыс", "Данияр"]
    },
    1127: {
        "do_use": ["Тайр", "Алинур", "Тимур"],
        "do_not_use": []
    },
    1128: {
        "do_use": [],
        "do_not_use": ["Алихан", "Назар", "Даирбек"]
    },
}
date_room_mapping = {

    '26.10': 1104,
    '27.10': 1105,
    '28.10': 1107,
    '29.10': 1108,
    '30.10': 1109,
    '31.10': 1110,
    '01.11': 1111,
    '02.11': 1114,
    '03.11': 1117,
    '04.11': 1119,
    '05.11': 1121,
    '06.11': 1122,
    '07.11': 1123,
    '08.11': 1125,
    '09.11': 1127,
    '10.11': [1101, 1106],
    '11.11': [1102, 1103],
    '12.11': [1113, 1115],
    '13.11': [1116, 1118,1120],
    '14.11': [1124, 1126],

}

last_day = list(date_room_mapping)[-1]

